app/views/pins/index.html.erb

              <p> <%= pin.description %></p>
              <p><%= pluralize(pin.likes.count, "like")%></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."pin_id" = ?  [["pin_id", 2]]