app/views/users/show.html.erb

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ?  [["user_id", 1]]
---
<div class = "row cosmic girl-grid">
  <% @user.pins.each do |pin| %>