app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["description", "grape"], ["created_at", "2019-07-23 16:46:37.259854"], ["updated_at", "2019-07-23 16:46:37.259854"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "1er edit pin"], ["updated_at", "2019-07-22 23:07:30.191867"], ["id", 1]]

    def correct_user
      @pin = current_user.pins.find_by(id: params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."user_id" = ? AND "pins"."id" = ? LIMIT ?  [["user_id", 2], ["id", 13], ["LIMIT", 1]]