app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ana"], ["LIMIT", 1]]
---
	def show
	   @user = User.find_by username: params[:username]